Importamos las librerías necesarias para el proyecto

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Exploración y limpieza de datos

* Exploración

Convertimos el primer archivo a usar en nuestro EDA en DataFrame. 

Se trata de la tabla de empadronados por provincia con la relación entre su lugar de nacimiento y la residencia actual

In [37]:
df = pd.read_csv("./Datasets/36683.csv", sep=";", encoding="latin1")

Previsualizamos los datos para ver como se encuentran distribuidos y que nos encontramos dentro

In [38]:
df.info()

df.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1800 entries, 0 to 1799
Data columns (total 8 columns):
 #   Column                                           Non-Null Count  Dtype
---  ------                                           --------------  -----
 0   Total Nacional                                   1800 non-null   object
 1   Comunidades y Ciudades Autónomas                 1775 non-null   object
 2   Provincias                                       1300 non-null   object
 3   Relacion entre lugar de nacimiento y residencia  1800 non-null   object
 4   Edad (grupos quinquenales)                       1800 non-null   object
 5   Sexo                                             1800 non-null   object
 6   Periodo                                          1800 non-null   object
 7   Total                                            1800 non-null   object
dtypes: object(8)
memory usage: 112.6+ KB

,Total Nacional,Comunidades y Ciudades Autónomas,Provincias,Relacion entre lugar de nacimiento y residencia,Edad (grupos quinquenales),Sexo,Periodo,Total
0,Total Nacional,16 País Vasco,01 Araba/Álava,En España,Todas las edades,Total,1 de enero de 2022,289.324
1,Total Nacional,16 País Vasco,01 Araba/Álava,En España,Todas las edades,Total,1 de enero de 2018,291.487
2,Total Nacional,16 País Vasco,01 Araba/Álava,En España,Todas las edades,Total,1 de enero de 2014,288.481
3,Total Nacional,16 País Vasco,01 Araba/Álava,En España,Todas las edades,Total,1 de enero de 2010,285.108
4,Total Nacional,16 País Vasco,01 Araba/Álava,En España,Todas las edades,Total,1 de enero de 2006,282.209

* Limpieza

<u>Eliminar datos irrelevantes o que no aportan información útil para el estudio</u>

Veo que las columnas Total Nacional', 'Edad (grupos quinquenales)'y 'Sexo', no van a aportar nada porque no sirven para dividir a la población, sino que siempre aparece la misma información. 

Decido eliminarlas definitivamente del DF

In [39]:
df.drop(['Total Nacional', 'Edad (grupos quinquenales)', 'Sexo'], axis= 1, inplace= True)

Hacemos una vista de como va quedando la información

In [40]:
df.head(5)

,Comunidades y Ciudades Autónomas,Provincias,Relacion entre lugar de nacimiento y residencia,Periodo,Total
0,16 País Vasco,01 Araba/Álava,En España,1 de enero de 2022,289.324
1,16 País Vasco,01 Araba/Álava,En España,1 de enero de 2018,291.487
2,16 País Vasco,01 Araba/Álava,En España,1 de enero de 2014,288.481
3,16 País Vasco,01 Araba/Álava,En España,1 de enero de 2010,285.108
4,16 País Vasco,01 Araba/Álava,En España,1 de enero de 2006,282.209

Para poder trabajar mejor con los datos, veo que en las columnas 'Comunidades y Ciudades Autónomas' y en 'Provincias' he de eliminar algunos caracteres.

Comprobamos que lo que hay que eliminar se repite en todas las filas y con el mismo número de caracteres, con lo que la limpieza de datos preeveo será sencilla y rápida. 

Ej: 16 País Vasco ----> He de quitar el str '16 '

Ej: 01 Araba/Alava ---> He de quitar el str '01 '

In [41]:

str_limpio_cyc = df["Comunidades y Ciudades Autónomas"].str[3:]
str_limpio_prov = df["Provincias"].str[3:]
str_limpio_periodo = df["Periodo"].str[14:]

Visualizamos como han quedado las columnas ya limpias

In [42]:
print("Provincia limpio", str_limpio_prov)
print("CA limpio", str_limpio_cyc)
print("Periodo", str_limpio_periodo)

Provincia limpio 0       Araba/Álava
1       Araba/Álava
2       Araba/Álava
3       Araba/Álava
4       Araba/Álava
           ...
1795            NaN
1796            NaN
1797            NaN
1798            NaN
1799            NaN
Name: Provincias, Length: 1800, dtype: object
CA limpio 0       País Vasco
1       País Vasco
2       País Vasco
3       País Vasco
4       País Vasco
           ...
1795           NaN
1796           NaN
1797           NaN
1798           NaN
1799           NaN
Name: Comunidades y Ciudades Autónomas, Length: 1800, dtype: object
Periodo 0       2022
1       2018
2       2014
3       2010
4       2006
        ...
1795    2022
1796    2018
1797    2014
1798    2010
1799    2006
Name: Periodo, Length: 1800, dtype: object

Una vez comprobado que nuestros datos aparecen limpios, sobreescribimos las columnas antiguas con los nuevos datos para que el DF quede actualizado.

In [43]:
df["Comunidades y Ciudades Autónomas"] = df["Comunidades y Ciudades Autónomas"].str[3:]
df["Provincias"] = df["Provincias"].str[3:]
df["Periodo"] = df["Periodo"].str[14:]

Comprobamos que todo aparece como esperábamos tras sobreescribir previsualizando de nuevo el DF

In [44]:
df.head(5)

,Comunidades y Ciudades Autónomas,Provincias,Relacion entre lugar de nacimiento y residencia,Periodo,Total
0,País Vasco,Araba/Álava,En España,2022,289.324
1,País Vasco,Araba/Álava,En España,2018,291.487
2,País Vasco,Araba/Álava,En España,2014,288.481
3,País Vasco,Araba/Álava,En España,2010,285.108
4,País Vasco,Araba/Álava,En España,2006,282.209

* Manejo de valores nulos

Hemos visto que había datos Nans en las columnas 'Comunidades y Ciudades Autónomas' y 'Provincias'

Quiero ver mas de que se tratan con mas detenimiento

In [45]:
print('Nulos en Comunidades y Ciudades', df['Comunidades y Ciudades Autónomas'].isna().sum())
print('Nulos en Provincias', df['Provincias'].isna().sum())

Nulos en Comunidades y Ciudades 25
Nulos en Provincias 500

In [46]:
# Investigo las lineas de los nulos 

nulos_index = df[df['Comunidades y Ciudades Autónomas'].isna()].index
print('Indices con valores nulos:', nulos_index)
print(df.loc[nulos_index])

Indices con valores nulos: Index([1775, 1776, 1777, 1778, 1779, 1780, 1781, 1782, 1783, 1784, 1785, 1786,
       1787, 1788, 1789, 1790, 1791, 1792, 1793, 1794, 1795, 1796, 1797, 1798,
       1799],
      dtype='int64')
     Comunidades y Ciudades Autónomas Provincias  \
1775                              NaN        NaN
1776                              NaN        NaN
1777                              NaN        NaN
1778                              NaN        NaN
1779                              NaN        NaN
1780                              NaN        NaN
1781                              NaN        NaN
1782                              NaN        NaN
1783                              NaN        NaN
1784                              NaN        NaN
1785                              NaN        NaN
1786                              NaN        NaN
1787                              NaN        NaN
1788                              NaN        NaN
1789                              NaN        NaN
1790                              NaN        NaN
1791                              NaN        NaN
1792                              NaN        NaN
1793                              NaN        NaN
1794                              NaN        NaN
1795                              NaN        NaN
1796                              NaN        NaN
1797                              NaN        NaN
1798                              NaN        NaN
1799                              NaN        NaN

     Relacion entre lugar de nacimiento y residencia Periodo       Total
1775                                       En España    2022  39.940.907
1776                                       En España    2018  40.336.076
1777                                       En España    2014  40.487.629
1778                                       En España    2010  40.416.850
1779                                       En España    2006  39.871.342
1780      Misma Comunidad Autónoma. Misma Provincia.    2022  31.722.745
1781      Misma Comunidad Autónoma. Misma Provincia.    2018  31.928.217
1782      Misma Comunidad Autónoma. Misma Provincia.    2014  31.887.072
1783      Misma Comunidad Autónoma. Misma Provincia.    2010  31.618.190
1784      Misma Comunidad Autónoma. Misma Provincia.    2006  31.011.297
1785    Misma Comunidad Autónoma. Distinta Provincia    2022   1.654.983
1786    Misma Comunidad Autónoma. Distinta Provincia    2018   1.642.927
1787    Misma Comunidad Autónoma. Distinta Provincia    2014   1.651.765
1788    Misma Comunidad Autónoma. Distinta Provincia    2010   1.661.034
1789    Misma Comunidad Autónoma. Distinta Provincia    2006   1.631.031
1790                  En distinta Comunidad Autónoma    2022   6.563.179
1791                  En distinta Comunidad Autónoma    2018   6.764.932
1792                  En distinta Comunidad Autónoma    2014   6.948.792
1793                  En distinta Comunidad Autónoma    2010   7.137.626
1794                  En distinta Comunidad Autónoma    2006   7.229.014
1795                                En el extranjero    2022   7.534.513
1796                                En el extranjero    2018   6.386.904
1797                                En el extranjero    2014   6.283.712
1798                                En el extranjero    2010   6.604.181
1799                                En el extranjero    2006   4.837.622

Tras investigar los nulos, compruebo que los datos que no se muestran son los de las comunidades y las provincias porque se refieren al total de España y por tanto no pueden mostrar ni Comunidad ni Provincia, pero si hay datos numéricos que me pueden interesar para refutar mis hipótesis. Decido por tanto quedarme estas líneas.

Hemos finalizado la limpieza y comprobación de nuestro primer Dataset. Lo dejamos a la espera del análisis. 

Empecemos con la limpieza de los siguientes.

* Exploración

En esta ocasión, al intentar descargar el Dataset desde la página web del INE, no me permitía hacerlo por periodo de mas de un año, ya que el volumen de los datos era muy grande. He decargado por tanto los años que me interesaban y vamos a proceder a unir los Datasets antes de procesarlos y limpiarlos

In [47]:
df1 = pd.read_csv("./Datasets/36825.csv", sep=";", encoding="latin1")
df2 = pd.read_csv("./Datasets/36826.csv", sep=";", encoding="latin1")
df3 = pd.read_csv("./Datasets/36827.csv", sep=";", encoding="latin1")
df4 = pd.read_csv("./Datasets/36828.csv", sep=";", encoding="latin1")
df5 = pd.read_csv("./Datasets/36829.csv", sep=";", encoding="latin1")

Hacemos una vista previa de los DataFrames para asegurarnos que todos contienen la misma información y que está organizada de la misma forma evitando así errores al combinar

In [48]:
df1.head(3)

,Total Nacional,Comunidades y Ciudades Autónomas,Provincias,País de nacionalidad,Edad (hasta 100 y más),Sexo,Periodo,Total
0,Total Nacional,NaN,NaN,Extranjera,Todas las edades,Total,1 de enero de 2006,4.144.166
1,Total Nacional,NaN,NaN,Europa (sin España),Todas las edades,Total,1 de enero de 2006,1.609.856
2,Total Nacional,NaN,NaN,Alemania,Todas las edades,Total,1 de enero de 2006,150.490

In [49]:
df2.head(3)

,Total Nacional,Comunidades y Ciudades Autónomas,Provincias,País de nacionalidad,Edad (hasta 100 y más),Sexo,Periodo,Total
0,Total Nacional,NaN,NaN,Extranjera,Todas las edades,Total,1 de enero de 2022,5.542.932
1,Total Nacional,NaN,NaN,Europa (sin España),Todas las edades,Total,1 de enero de 2022,2.205.961
2,Total Nacional,NaN,NaN,Alemania,Todas las edades,Total,1 de enero de 2022,116.122

In [50]:
df3.head(3)

,Total Nacional,Comunidades y Ciudades Autónomas,Provincias,País de nacionalidad,Edad (hasta 100 y más),Sexo,Periodo,Total
0,Total Nacional,NaN,NaN,Extranjera,Todas las edades,Total,1 de enero de 2018,4.734.691
1,Total Nacional,NaN,NaN,Europa (sin España),Todas las edades,Total,1 de enero de 2018,2.061.035
2,Total Nacional,NaN,NaN,Alemania,Todas las edades,Total,1 de enero de 2018,111.495

In [51]:
df4.head(3)

,Total Nacional,Comunidades y Ciudades Autónomas,Provincias,País de nacionalidad,Edad (hasta 100 y más),Sexo,Periodo,Total
0,Total Nacional,NaN,NaN,Extranjera,Todas las edades,Total,1 de enero de 2014,5.023.487
1,Total Nacional,NaN,NaN,Europa (sin España),Todas las edades,Total,1 de enero de 2014,2.299.165
2,Total Nacional,NaN,NaN,Alemania,Todas las edades,Total,1 de enero de 2014,140.511

In [52]:
df5.head(3)

,Total Nacional,Comunidades y Ciudades Autónomas,Provincias,País de nacionalidad,Edad (hasta 100 y más),Sexo,Periodo,Total
0,Total Nacional,NaN,NaN,Extranjera,Todas las edades,Total,1 de enero de 2010,5.747.734
1,Total Nacional,NaN,NaN,Europa (sin España),Todas las edades,Total,1 de enero de 2010,2.578.971
2,Total Nacional,NaN,NaN,Alemania,Todas las edades,Total,1 de enero de 2010,195.824

Una vez comprobado que tenemos las mismas columnas y aparentemente los mismos datos en cada una, procedemos a unirlos

In [53]:
df_ext = pd.concat([df1, df2, df3, df4, df5], ignore_index=True)

Comprobamos que todo está unido como debe

In [54]:
df_ext.head()

,Total Nacional,Comunidades y Ciudades Autónomas,Provincias,País de nacionalidad,Edad (hasta 100 y más),Sexo,Periodo,Total
0,Total Nacional,NaN,NaN,Extranjera,Todas las edades,Total,1 de enero de 2006,4.144.166
1,Total Nacional,NaN,NaN,Europa (sin España),Todas las edades,Total,1 de enero de 2006,1.609.856
2,Total Nacional,NaN,NaN,Alemania,Todas las edades,Total,1 de enero de 2006,150.490
3,Total Nacional,NaN,NaN,Austria,Todas las edades,Total,1 de enero de 2006,7.776
4,Total Nacional,NaN,NaN,Bélgica,Todas las edades,Total,1 de enero de 2006,29.526

In [55]:
df_ext.tail()

,Total Nacional,Comunidades y Ciudades Autónomas,Provincias,País de nacionalidad,Edad (hasta 100 y más),Sexo,Periodo,Total
46795,Total Nacional,19 Melilla,52 Melilla,De Oceanía,Todas las edades,Total,1 de enero de 2010,0
46796,Total Nacional,19 Melilla,52 Melilla,Australia,Todas las edades,Total,1 de enero de 2010,0
46797,Total Nacional,19 Melilla,52 Melilla,Nueva Zelanda,Todas las edades,Total,1 de enero de 2010,0
46798,Total Nacional,19 Melilla,52 Melilla,Resto de Nacionalidades de Oceanía,Todas las edades,Total,1 de enero de 2010,0
46799,Total Nacional,19 Melilla,52 Melilla,Apátridas,Todas las edades,Total,1 de enero de 2010,1

In [56]:
df_ext.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46800 entries, 0 to 46799
Data columns (total 8 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Total Nacional                    46800 non-null  object
 1   Comunidades y Ciudades Autónomas  46150 non-null  object
 2   Provincias                        33800 non-null  object
 3   País de nacionalidad              46800 non-null  object
 4   Edad (hasta 100 y más)            46800 non-null  object
 5   Sexo                              46800 non-null  object
 6   Periodo                           46800 non-null  object
 7   Total                             46440 non-null  object
dtypes: object(8)
memory usage: 2.9+ MB

In [57]:
df_ext.columns

Index(['Total Nacional', 'Comunidades y Ciudades Autónomas', 'Provincias',
       'País de nacionalidad', 'Edad (hasta 100 y más)', 'Sexo', 'Periodo',
       'Total'],
      dtype='object')

Parece que nuestros datos son correctos. Proseguimos con la limpieza.

* Limpieza

<u>Eliminar datos irrelevantes o que no aportan información útil para el estudio</u>

Igual que en el DataSet anterior, comprobamos que hay columnas que no aportarán nada a nuestro estudio. 

Decidimos por tanto borrar las columnas 'Total Nacional', 'Edad (hasta 100 y más)' y 'Sexo'

In [63]:
df_ext.drop(['Total Nacional', 'Edad (hasta 100 y más)', 'Sexo'], axis= 1, inplace= True)

Comprobamos que se han eliminado correctamente

In [64]:
df_ext

,Comunidades y Ciudades Autónomas,Provincias,País de nacionalidad,Periodo,Total
0,NaN,NaN,Extranjera,1 de enero de 2006,4.144.166
2,NaN,NaN,Alemania,1 de enero de 2006,150.490
3,NaN,NaN,Austria,1 de enero de 2006,7.776
4,NaN,NaN,Bélgica,1 de enero de 2006,29.526
5,NaN,NaN,Bulgaria,1 de enero de 2006,101.617
...,...,...,...,...,...
46795,19 Melilla,52 Melilla,De Oceanía,1 de enero de 2010,0
46796,19 Melilla,52 Melilla,Australia,1 de enero de 2010,0
46797,19 Melilla,52 Melilla,Nueva Zelanda,1 de enero de 2010,0
46798,19 Melilla,52 Melilla,Resto de Nacionalidades de Oceanía,1 de enero de 2010,0
46799,19 Melilla,52 Melilla,Apátridas,1 de enero de 2010,1

También vemos que igual que en el Dataset anterior las columnas 'Comunidades y Ciudades Autónomas', 'Provincias' y 'Periodo', tienen caracteres de mas en sus strings que no necesitamos. Procedemos a eliminarlos

In [65]:
str_limpio_cyc = df_ext["Comunidades y Ciudades Autónomas"].str[3:]
str_limpio_prov = df_ext["Provincias"].str[3:]
str_limpio_periodo = df_ext["Periodo"].str[14:]

Comprobamos que el str presenta la información que buscábamos

In [66]:
print(str_limpio_cyc)
print(str_limpio_prov)
print(str_limpio_periodo)

0            NaN
2            NaN
3            NaN
4            NaN
5            NaN
          ...
46795    Melilla
46796    Melilla
46797    Melilla
46798    Melilla
46799    Melilla
Name: Comunidades y Ciudades Autónomas, Length: 45000, dtype: object
0            NaN
2            NaN
3            NaN
4            NaN
5            NaN
          ...
46795    Melilla
46796    Melilla
46797    Melilla
46798    Melilla
46799    Melilla
Name: Provincias, Length: 45000, dtype: object
0        2006
2        2006
3        2006
4        2006
5        2006
         ...
46795    2010
46796    2010
46797    2010
46798    2010
46799    2010
Name: Periodo, Length: 45000, dtype: object

Ahora que está toda la información útil, sobreescribimos las columnas necesarias

In [67]:
df_ext["Comunidades y Ciudades Autónomas"] = df_ext["Comunidades y Ciudades Autónomas"].str[3:]
df_ext["Provincias"] = df_ext["Provincias"].str[3:]
df_ext["Periodo"] = df_ext["Periodo"].str[14:]

* Corregir inconsistencias

Al descargar la tabla, me llamó la atención que había muchos datos de América, tengo la sensación de que hay datos duplicados. Para ello voy a ver la lista de valores unicos de los paises, para ver si estoy en lo cierto

In [68]:
df_ext['País de nacionalidad'].unique()

array(['Extranjera', 'Alemania', 'Austria', 'Bélgica', 'Bulgaria',
       'Chipre', 'Croacia', 'Dinamarca', 'Eslovenia', 'Estonia',
       'Finlandia', 'Francia', 'Grecia', 'Hungría', 'Irlanda', 'Italia',
       'Letonia', 'Lituania', 'Luxemburgo', 'Malta', 'Países Bajos',
       'Polonia', 'Portugal', 'República Checa', 'República Eslovaca',
       'Rumanía', 'Suecia', 'Albania', 'Andorra', 'Armenia', 'Belarús',
       'Bosnia y Herzegovina', 'Georgia', 'Islandia', 'Liechtenstein',
       'Macedonia del Norte', 'Moldavia', 'Noruega', 'Reino Unido',
       'Rusia', 'Serbia', 'Serbia y Montenegro', 'Suiza', 'Turquía',
       'Ucrania', 'Resto de Nacionalidades Europeas', 'De Africa',
       'Angola', 'Argelia', 'Benin', 'Burkina Faso', 'Cabo Verde',
       'Camerún', 'Congo', 'Costa de Marfil', 'Egipto', 'Etiopía',
       'Gambia', 'Ghana', 'Guinea', 'Guinea Ecuatorial', 'Guinea-Bissau',
       'Kenia', 'Liberia', 'Mali', 'Marruecos', 'Mauritania', 'Nigeria',
       'República Democrática del Congo', 'Senegal', 'Sierra Leona',
       'Sudáfrica', 'Togo', 'Túnez', 'Resto de Nacionalidades Africanas',
       'Costa Rica', 'Cuba', 'Dominica', 'El Salvador', 'Guatemala',
       'Honduras', 'Nicaragua', 'Panamá', 'República Dominicana',
       'Resto de Nacionalidades de América Central y Caribe', 'Canadá',
       'Estados Unidos de América', 'México', 'Argentina', 'Bolivia',
       'Brasil', 'Chile', 'Colombia', 'Ecuador', 'Paraguay', 'Perú',
       'Uruguay', 'Venezuela',
       'Resto de Nacionalidades de América del Sur', 'De Asia',
       'Arabia Saudí', 'Bangladesh', 'China', 'Corea', 'Filipinas',
       'India', 'Indonesia', 'Irán', 'Iraq', 'Israel', 'Japón',
       'Jordania', 'Kazajstán', 'Líbano', 'Nepal', 'Pakistán', 'Siria',
       'Tailandia', 'Vietnam', 'Resto de Nacionalidades Asiáticas',
       'De Oceanía', 'Australia', 'Nueva Zelanda',
       'Resto de Nacionalidades de Oceanía', 'Apátridas'], dtype=object)

Como había previsto, algunos datos vienen agrupados por regiones o continentes, lo que puede provocar que mi conjunto de datos esté menos organizado y genere problemas al realizar cálculos estadísticos, como obtener máximos, mínimos o totales, afectando la validez de mis hipótesis.

En particular, no necesito incluir las filas correspondientes a las siguientes categorías agrupadas:
'Europa (sin España)', 'De África', 'De América', 'De Centro América y Caribe', 'De América del Norte' y 'De Sudamérica'.

Decido borrarlos

In [62]:
categorias_a_eliminar = [
    'Europa (sin España)',
    'De África',
    'De América',
    'De Centro América y Caribe',
    'De América del Norte',
    'De Sudamérica'
]

df_ext = df_ext[~df_ext['País de nacionalidad'].isin(categorias_a_eliminar)]

* Tratamiento de Nans

Mirando los datos, compruebo que los Nans existentes, al igual que en el anterior DataSet son totalizados de España que no pueden entrar en ninguna comunidad Autónoma ni Provincia, por lo que decido quedarmelos por si me fueran necesario en la resolución de las hipótesis planteadas

## USO DE SELENIUM PARA LA DESCARGA DE DATOS

He comprobado que la descarga de DataSets desde la web de INE es muy amigable e intuitiva, por eso, el tercer y último DataSet, lo descargaré con Selenium haciendo pasar mi computadora por persona.